avr-rust/avrd/packs/atmega/ATmega406.atdf
          </instance>
          <instance name="PORTC" caption="I/O Port">
            <register-group name="PORTC" name-in-module="PORTC" offset="0x00" address-space="data" caption="I/O Port"/>
          </instance>
          <instance name="PORTD" caption="I/O Port">
            <register-group name="PORTD" name-in-module="PORTD" offset="0x00" address-space="data" caption="I/O Port"/>
          </instance>
        </module>
        <module name="BOOT_LOAD">
          <instance name="BOOT_LOAD" caption="Bootloader">
            <register-group name="BOOT_LOAD" name-in-module="BOOT_LOAD" offset="0x00" address-space="data" caption="Bootloader"/>
          </instance>
        </module>
        <module name="TWI">
          <instance name="TWI" caption="Two Wire Serial Interface">
            <register-group name="TWI" name-in-module="TWI" offset="0x00" address-space="data" caption="Two Wire Serial Interface"/>
          </instance>
        </module>
        <module name="BANDGAP">
          <instance name="BANDGAP" caption="Bandgap">
            <register-group name="BANDGAP" name-in-module="BANDGAP" offset="0x00" address-space="data" caption="Bandgap"/>
          </instance>
        </module>
        <module name="EEPROM">
          <instance name="EEPROM" caption="EEPROM">
            <register-group name="EEPROM" name-in-module="EEPROM" offset="0x00" address-space="data" caption="EEPROM"/>
          </instance>
        </module>
        <module name="FUSE">
          <instance name="FUSE" caption="Fuses">
            <register-group name="FUSE" name-in-module="FUSE" offset="0" address-space="fuses" caption="Fuses"/>
          </instance>
        </module>
        <module name="LOCKBIT">
          <instance name="LOCKBIT" caption="Lockbits">
            <register-group name="LOCKBIT" name-in-module="LOCKBIT" offset="0" address-space="lockbits" caption="Lockbits"/>
          </instance>
        </module>
      </peripherals>


      <interrupts>
        <interrupt index="0" name="RESET" caption="External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset"/>
        <interrupt index="1" name="BPINT" caption="Battery Protection Interrupt"/>
        <interrupt index="2" name="INT0" caption="External Interrupt Request 0"/>
        <interrupt index="3" name="INT1" caption="External Interrupt Request 1"/>
        <interrupt index="4" name="INT2" caption="External Interrupt Request 2"/>
        <interrupt index="5" name="INT3" caption="External Interrupt Request 3"/>
        <interrupt index="6" name="PCINT0" caption="Pin Change Interrupt 0"/>
        <interrupt index="7" name="PCINT1" caption="Pin Change Interrupt 1"/>
        <interrupt index="8" name="WDT" caption="Watchdog Timeout Interrupt"/>
        <interrupt index="9" name="WAKE_UP" caption="Wakeup timer overflow"/>
        <interrupt index="10" name="TIM1_COMP" caption="Timer/Counter 1 Compare Match"/>
        <interrupt index="11" name="TIM1_OVF" caption="Timer/Counter 1 Overflow"/>
        <interrupt index="12" name="TIM0_COMPA" caption="Timer/Counter0 Compare A Match"/>
        <interrupt index="13" name="TIM0_COMPB" caption="Timer/Counter0 Compare B Match"/>
        <interrupt index="14" name="TIM0_OVF" caption="Timer/Counter0 Overflow"/>
        <interrupt index="15" name="TWI_BUS_CD" caption="Two-Wire Bus Connect/Disconnect"/>
        <interrupt index="16" name="TWI" caption="Two-Wire Serial Interface"/>
        <interrupt index="17" name="VADC" caption="Voltage ADC Conversion Complete"/>
        <interrupt index="18" name="CCADC_CONV" caption="Coulomb Counter ADC Conversion Complete"/>
        <interrupt index="19" name="CCADC_REG_CUR" caption="Coloumb Counter ADC Regular Current"/>
        <interrupt index="20" name="CCADC_ACC" caption="Coloumb Counter ADC Accumulator"/>
        <interrupt index="21" name="EE_READY" caption="EEPROM Ready"/>
        <interrupt index="22" name="SPM_READY" caption="Store Program Memory Ready"/>
      </interrupts>
      <interfaces>
        <interface name="HVPP" type="hvpp"/>
        <interface name="JTAG" type="megajtag"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="JTAGID" value="0x0950703F"/>
          <property name="SIGNATURE0" value="0x1e"/>
          <property name="SIGNATURE1" value="0x95"/>
          <property name="SIGNATURE2" value="0x07"/>
        </property-group>
        <property-group name="OCD">
          <property name="OCD_REVISION" value="3"/>
          <property name="OCD_DATAREG" value="0x31"/>
          <property name="PROGBASE" value="0x0000"/>
        </property-group>
        <property-group name="JTAG_INTERFACE">
          <property name="ALLOWFULLPAGESTREAM" value="0x00"/>
        </property-group>
        <property-group name="PP_INTERFACE">
          <property name="PpControlStack" value="0x0E 0x1E 0x0F 0x1F 0x2E 0x3E 0x2F 0x3F 0x4E 0x5E 0x4F 0x5F 0x6E 0x7E 0x6F 0x7F 0x66 0x76 0x67 0x77 0x6A 0x7A 0x6B 0x7B 0xBE 0xFD 0x00 0x01 0x00 0x00 0x00 0x00"/>
          <property name="PpEnterProgMode_stabDelay" value="100"/>
          <property name="PpEnterProgMode_progModeDelay" value="0"/>
          <property name="PpEnterProgMode_latchCycles" value="6"/>
          <property name="PpEnterProgMode_toggleVtg" value="0"/>
          <property name="PpEnterProgMode_powerOffDelay" value="0"/>
          <property name="PpEnterProgMode_resetDelayMs" value="0"/>
          <property name="PpEnterProgMode_resetDelayUs" value="0"/>
          <property name="PpLeaveProgMode_stabDelay" value="15"/>
          <property name="PpLeaveProgMode_resetDelay" value="15"/>
          <property name="PpChipErase_pulseWidth" value="0"/>
          <property name="PpChipErase_pollTimeout" value="10"/>
          <property name="PpProgramFlash_pollTimeout" value="5"/>
          <property name="PpProgramFlash_mode" value="0x0F"/>
          <property name="PpProgramFlash_blockSize" value="256"/>
          <property name="PpReadFlash_blockSize" value="256"/>
          <property name="PpProgramEeprom_pollTimeout" value="5"/>
          <property name="PpProgramEeprom_mode" value="0x07"/>
          <property name="PpProgramEeprom_blockSize" value="256"/>
          <property name="PpReadEeprom_blockSize" value="256"/>
          <property name="PpProgramFuse_pulseWidth" value="0"/>
          <property name="PpProgramFuse_pollTimeout" value="5"/>
          <property name="PpProgramLock_pulseWidth" value="0"/>
          <property name="PpProgramLock_pollTimeout" value="5"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module caption="Fuses" name="FUSE">
      <register-group caption="Fuses" name="FUSE">
        <register caption="" name="HIGH" offset="0x01" size="1" initval="0xFE">
          <bitfield caption="On-Chip Debug Enabled" mask="0x02" name="OCDEN"/>
          <bitfield caption="JTAG Interface Enabled" mask="0x01" name="JTAGEN"/>
        </register>
