avr-rust/avrd/packs/atmega/ATmega406.atdf
        <register caption="Pin Change Enable Mask Register 0" name="PCMSK0" offset="0x6B" size="1" mask="0xFF"/>
      </register-group>
      <value-group caption="Interrupt Sense Control" name="INTERRUPT_SENSE_CONTROL">
        <value caption="Low Level of INTX" name="VAL_0x00" value="0x00"/>
        <value caption="Any Logical Change of INTX" name="VAL_0x01" value="0x01"/>
        <value caption="Falling Edge of INTX" name="VAL_0x02" value="0x02"/>
        <value caption="Rising Edge of INTX" name="VAL_0x03" value="0x03"/>
      </value-group>
    </module>
    <module caption="Timer/Counter, 16-bit" name="TC16">
      <register-group caption="Timer/Counter, 16-bit" name="TC1">
        <register caption="Timer/Counter1 Control Register B" name="TCCR1B" offset="0x81" size="1">
          <bitfield caption="Clear Timer/Counter on Compare Match" mask="0x08" name="CTC1"/>
          <bitfield caption="Clock Select1 bits" mask="0x07" name="CS1" values="CLK_SEL_3BIT"/>
        </register>
        <register caption="Timer Counter 1  Bytes" name="TCNT1" offset="0x84" size="2" mask="0xFFFF"/>
        <register caption="Output Compare Register 1A Low byte" name="OCR1AL" offset="0x88" size="1" mask="0xFF"/>
        <register caption="Output Compare Register 1A High byte" name="OCR1AH" offset="0x89" size="1" mask="0xFF"/>
        <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK1" offset="0x6F" size="1">
          <bitfield caption="Timer/Counter1 Output Compare Interrupt Enable" mask="0x02" name="OCIE1A"/>
          <bitfield caption="Timer/Counter1 Overflow Interrupt Enable" mask="0x01" name="TOIE1"/>
        </register>
        <register caption="Timer/Counter Interrupt Flag register" name="TIFR1" offset="0x36" size="1" ocd-rw="R">
          <bitfield caption="Timer/Counter1 Output Compare Flag A" mask="0x02" name="OCF1A"/>
          <bitfield caption="Timer/Counter1 Overflow Flag" mask="0x01" name="TOV1"/>
        </register>
        <register caption="General Timer/Counter Control Register" name="GTCCR" offset="0x43" size="1">
          <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
          <bitfield caption="Prescaler Reset" mask="0x01" name="PSRSYNC"/>
        </register>
      </register-group>
      <value-group caption="" name="CLK_SEL_3BIT">
        <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
        <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
        <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
        <value caption="Running, CLK/32" name="VAL_0x03" value="0x03"/>
        <value caption="Running, CLK/64" name="VAL_0x04" value="0x04"/>
        <value caption="Running, CLK/128" name="VAL_0x05" value="0x05"/>
        <value caption="Running, CLK/256" name="VAL_0x06" value="0x06"/>
        <value caption="Running, CLK/1024" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="Wakeup Timer" name="WAKEUP_TIMER">
      <register-group caption="Wakeup Timer" name="WAKEUP_TIMER">
        <register caption="Wake-up Timer Control Register" name="WUTCSR" offset="0x62" size="1" ocd-rw="R">
          <bitfield caption="Wake-up Timer Interrupt Flag" mask="0x80" name="WUTIF"/>
          <bitfield caption="Wake-up Timer Interrupt Enable" mask="0x40" name="WUTIE"/>
          <bitfield caption="Wake-up timer Calibration Flag" mask="0x20" name="WUTCF"/>
          <bitfield caption="Wake-up Timer Reset" mask="0x10" name="WUTR"/>
          <bitfield caption="Wake-up Timer Enable" mask="0x08" name="WUTE"/>
          <bitfield caption="Wake-up Timer Prescaler Bits" mask="0x07" name="WUTP" values="CLK_SEL_3BIT_ONLY_PRESCALE"/>
        </register>
      </register-group>
      <value-group caption="" name="CLK_SEL_3BIT_ONLY_PRESCALE">
        <value caption="4K(Slow RC) / 1K (32kHz)" name="VAL_0x00" value="0x00"/>
        <value caption="8K(Slow RC) / 2K (32kHz)" name="VAL_0x01" value="0x01"/>
        <value caption="16K(Slow RC) / 4K (32kHz)" name="VAL_0x02" value="0x02"/>
        <value caption="32K(Slow RC) / 8K (32kHz)" name="VAL_0x03" value="0x03"/>
        <value caption="64K(Slow RC) / 16K (32kHz)" name="VAL_0x04" value="0x04"/>
        <value caption="128K(Slow RC) / 32K (32kHz)" name="VAL_0x05" value="0x05"/>
        <value caption="256K(Slow RC) / 64K (32kHz)" name="VAL_0x06" value="0x06"/>
        <value caption="512K(Slow RC) / 128K (32kHz)" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="Battery Protection" name="BATTERY_PROTECTION">
      <register-group caption="Battery Protection" name="BATTERY_PROTECTION">
        <register caption="Battery Protection Parameter Lock Register" name="BPPLR" offset="0xF8" size="1" ocd-rw="R">
          <bitfield caption="Battery Protection Parameter Lock Enable" mask="0x02" name="BPPLE"/>
          <bitfield caption="Battery Protection Parameter Lock" mask="0x01" name="BPPL"/>
        </register>
        <register caption="Battery Protection Control Register" name="BPCR" offset="0xF7" size="1">
          <bitfield caption="" mask="0x08" name="DUVD"/>
          <bitfield caption="" mask="0x04" name="SCD"/>
          <bitfield caption="" mask="0x02" name="DCD"/>
          <bitfield caption="" mask="0x01" name="CCD"/>
        </register>
        <register caption="Current Battery Protection Timing Register" name="CBPTR" offset="0xF6" size="1">
          <bitfield caption="" mask="0xF0" name="SCPT" values="BAT_SHORT_CIRC_DELAY"/>
          <bitfield caption="" mask="0x0F" name="OCPT" values="BAT_OVER_CURRENT_DELAY"/>
        </register>
        <register caption="Battery Protection OverCurrent Detection Level Register" name="BPOCD" offset="0xF5" size="1">
          <bitfield caption="" mask="0xF0" name="DCDL" values="BAT_VOLT_SENSE"/>
          <bitfield caption="" mask="0x0F" name="CCDL" values="BAT_VOLT_SENSE"/>
        </register>
        <register caption="Battery Protection Short-Circuit Detection Level Register" name="BPSCD" offset="0xF4" size="1">
          <bitfield caption="" mask="0x0F" name="SCDL" values="BAT_VOLT_SENSE2"/>
        </register>
        <register caption="Battery Protection Deep Under Voltage Register" name="BPDUV" offset="0xF3" size="1">
          <bitfield caption="" mask="0x30" name="DUVT" values="BAT_DEEP_UNDER_DELAY"/>
          <bitfield caption="" mask="0x0F" name="DUDL" values="BAT_DEEP_UNDER_LEVEL"/>
        </register>
