avr-rust/avrd/packs/atmega/ATmega406.atdf
        <register caption="Battery Protection Interrupt Register" name="BPIR" offset="0xF2" size="1" ocd-rw="R">
          <bitfield caption="Deep Under-voltage Early Warning Interrupt Flag" mask="0x80" name="DUVIF"/>
          <bitfield caption="Charge Over-current Protection Activated Interrupt Flag" mask="0x40" name="COCIF"/>
          <bitfield caption="" mask="0x20" name="DOCIF"/>
          <bitfield caption="" mask="0x10" name="SCIF"/>
          <bitfield caption="Deep Under-voltage Early Warning Interrupt Enable" mask="0x08" name="DUVIE"/>
          <bitfield caption="" mask="0x04" name="COCIE"/>
          <bitfield caption="" mask="0x02" name="DOCIE"/>
          <bitfield caption="" mask="0x01" name="SCIE"/>
        </register>
      </register-group>
      <value-group caption="" name="BAT_SHORT_CIRC_DELAY">
        <value caption="61 us" name="VAL_0x00" value="0x00"/>
        <value caption="122 us" name="VAL_0x01" value="0x01"/>
        <value caption="183 us" name="VAL_0x02" value="0x02"/>
        <value caption="244 us" name="VAL_0x03" value="0x03"/>
        <value caption="305 us" name="VAL_0x04" value="0x04"/>
        <value caption="366 us" name="VAL_0x05" value="0x05"/>
        <value caption="427 us" name="VAL_0x06" value="0x06"/>
        <value caption="488 us" name="VAL_0x07" value="0x07"/>
        <value caption="610 us" name="VAL_0x08" value="0x08"/>
        <value caption="732 us" name="VAL_0x09" value="0x09"/>
        <value caption="854 us" name="VAL_0x0A" value="0x0A"/>
        <value caption="976 us" name="VAL_0x0B" value="0x0B"/>
        <value caption="1098 us" name="VAL_0x0C" value="0x0C"/>
        <value caption="1220 us" name="VAL_0x0D" value="0x0D"/>
        <value caption="1342 us" name="VAL_0x0E" value="0x0E"/>
        <value caption="1464 us" name="VAL_0x0F" value="0x0F"/>
      </value-group>
      <value-group caption="" name="BAT_OVER_CURRENT_DELAY">
        <value caption="1 ms" name="VAL_0x00" value="0x00"/>
        <value caption="2 ms" name="VAL_0x01" value="0x01"/>
        <value caption="4 ms" name="VAL_0x02" value="0x02"/>
        <value caption="6 ms" name="VAL_0x03" value="0x03"/>
        <value caption="8 ms" name="VAL_0x04" value="0x04"/>
        <value caption="10 ms" name="VAL_0x05" value="0x05"/>
        <value caption="12 ms" name="VAL_0x06" value="0x06"/>
        <value caption="14 ms" name="VAL_0x07" value="0x07"/>
        <value caption="16 ms" name="VAL_0x08" value="0x08"/>
        <value caption="18 ms" name="VAL_0x09" value="0x09"/>
        <value caption="20 ms" name="VAL_0x0A" value="0x0A"/>
        <value caption="22 ms" name="VAL_0x0B" value="0x0B"/>
        <value caption="24 ms" name="VAL_0x0C" value="0x0C"/>
        <value caption="26 ms" name="VAL_0x0D" value="0x0D"/>
        <value caption="28 ms" name="VAL_0x0E" value="0x0E"/>
        <value caption="30 ms" name="VAL_0x0F" value="0x0F"/>
      </value-group>
      <value-group caption="" name="BAT_VOLT_SENSE">
        <value caption="0.050V" name="VAL_0x00" value="0x00"/>
        <value caption="0.055V" name="VAL_0x01" value="0x01"/>
        <value caption="0.060V" name="VAL_0x02" value="0x02"/>
        <value caption="0.065V" name="VAL_0x03" value="0x03"/>
        <value caption="0.070V" name="VAL_0x04" value="0x04"/>
        <value caption="0.080V" name="VAL_0x05" value="0x05"/>
        <value caption="0.090V" name="VAL_0x06" value="0x06"/>
        <value caption="0.100V" name="VAL_0x07" value="0x07"/>
        <value caption="0.110V" name="VAL_0x08" value="0x08"/>
        <value caption="0.120V" name="VAL_0x09" value="0x09"/>
        <value caption="0.130V" name="VAL_0x0A" value="0x0A"/>
        <value caption="0.140V" name="VAL_0x0B" value="0x0B"/>
        <value caption="0.160V" name="VAL_0x0C" value="0x0C"/>
        <value caption="0.180V" name="VAL_0x0D" value="0x0D"/>
        <value caption="0.200V" name="VAL_0x0E" value="0x0E"/>
        <value caption="0.220V" name="VAL_0x0F" value="0x0F"/>
      </value-group>
      <value-group caption="" name="BAT_VOLT_SENSE2">
        <value caption="0.100V" name="VAL_0x00" value="0x00"/>
        <value caption="0.110V" name="VAL_0x01" value="0x01"/>
        <value caption="0.120V" name="VAL_0x02" value="0x02"/>
        <value caption="0.130V" name="VAL_0x03" value="0x03"/>
        <value caption="0.140V" name="VAL_0x04" value="0x04"/>
        <value caption="0.160V" name="VAL_0x05" value="0x05"/>
        <value caption="0.180V" name="VAL_0x06" value="0x06"/>
        <value caption="0.200V" name="VAL_0x07" value="0x07"/>
        <value caption="0.220V" name="VAL_0x08" value="0x08"/>
        <value caption="0.240V" name="VAL_0x09" value="0x09"/>
        <value caption="0.260V" name="VAL_0x0A" value="0x0A"/>
        <value caption="0.280V" name="VAL_0x0B" value="0x0B"/>
        <value caption="0.320V" name="VAL_0x0C" value="0x0C"/>
        <value caption="0.360V" name="VAL_0x0D" value="0x0D"/>
        <value caption="0.400V" name="VAL_0x0E" value="0x0E"/>
        <value caption="0.440V" name="VAL_0x0F" value="0x0F"/>
      </value-group>
      <value-group caption="" name="BAT_DEEP_UNDER_DELAY">
        <value caption="750ms" name="VAL_0x00" value="0x00"/>
        <value caption="1000ms" name="VAL_0x01" value="0x01"/>
        <value caption="1250ms" name="VAL_0x02" value="0x02"/>
        <value caption="1500ms" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="BAT_DEEP_UNDER_LEVEL">
        <value caption="4.71V" name="VAL_0x00" value="0x00"/>
        <value caption="5.03V" name="VAL_0x01" value="0x01"/>
        <value caption="5.34V" name="VAL_0x02" value="0x02"/>
        <value caption="5.66V" name="VAL_0x03" value="0x03"/>
        <value caption="5.97V" name="VAL_0x04" value="0x04"/>
        <value caption="6.29V" name="VAL_0x05" value="0x05"/>
        <value caption="6.60V" name="VAL_0x06" value="0x06"/>
        <value caption="6.91V" name="VAL_0x07" value="0x07"/>
        <value caption="7.23V" name="VAL_0x08" value="0x08"/>
        <value caption="7.54V" name="VAL_0x09" value="0x09"/>
        <value caption="7.86V" name="VAL_0x0A" value="0x0A"/>
        <value caption="8.17V" name="VAL_0x0B" value="0x0B"/>
        <value caption="8.49V" name="VAL_0x0C" value="0x0C"/>
        <value caption="8.80V" name="VAL_0x0D" value="0x0D"/>
        <value caption="9.11V" name="VAL_0x0E" value="0x0E"/>
        <value caption="9.43V" name="VAL_0x0F" value="0x0F"/>
      </value-group>
    </module>
    <module caption="FET Control" name="FET">
      <register-group caption="FET Control" name="FET">
        <register caption="" name="FCSR" offset="0xF0" size="1">
          <bitfield caption="Pulse Width Modulation of OC output" mask="0x20" name="PWMOC"/>
          <bitfield caption="Pulse Width Modulation Modulation of OPC output" mask="0x10" name="PWMOPC"/>
          <bitfield caption="Current Protection Status" mask="0x08" name="CPS"/>
          <bitfield caption="Discharge FET Enable" mask="0x04" name="DFE"/>
          <bitfield caption="Charge FET Enable" mask="0x02" name="CFE"/>
          <bitfield caption="Precharge FET disable" mask="0x01" name="PFD"/>
        </register>
      </register-group>
    </module>
    <module caption="Coulomb Counter" name="COULOMB_COUNTER">
      <register-group caption="Coulomb Counter" name="COULOMB_COUNTER">
        <register caption="CC-ADC Control and Status Register A" name="CADCSRA" offset="0xE4" size="1">
          <bitfield caption="When the CADEN bit is cleared (zero), the CC-ADC is disabled. When the CADEN bit is set (one), the CC-ADC will continuously measure the voltage drop over the external sense resistor RSENSE. In Power-down, only the Regular Current detection is active. In Power-off, the CC-ADC is always disabled." mask="0x80" name="CADEN"/>
          <bitfield caption="CC_ADC Update Busy" mask="0x20" name="CADUB"/>
          <bitfield caption="CC_ADC Accumulate Current Select Bits" mask="0x18" name="CADAS" values="ANALOG_CADA_ACC_TIME"/>
          <bitfield caption="The CADSI bits determine the current sampling interval for the Regular Current detection in Power-down mode. The actual settings remain to be determined." mask="0x06" name="CADSI" values="ANALOG_CADA_ACC_TIME"/>
          <bitfield caption="When the CADSE bit is written to one, the ongoing CC-ADC conversion is aborted, and the CC-ADC enters Regular Current detection mode." mask="0x01" name="CADSE"/>
        </register>
        <register caption="CC-ADC Control and Status Register B" name="CADCSRB" offset="0xE5" size="1" ocd-rw="R">
          <bitfield caption="" mask="0x40" name="CADACIE"/>
          <bitfield caption="Regular Current Interrupt Enable" mask="0x20" name="CADRCIE"/>
          <bitfield caption="CAD Instantenous Current Interrupt Enable" mask="0x10" name="CADICIE"/>
          <bitfield caption="CC-ADC Accumulate Current Interrupt Flag" mask="0x04" name="CADACIF"/>
          <bitfield caption="CC-ADC Accumulate Current Interrupt Flag" mask="0x02" name="CADRCIF"/>
          <bitfield caption="CC-ADC Instantaneous Current Interrupt Flag" mask="0x01" name="CADICIF"/>
        </register>
        <register caption="CC-ADC Instantaneous Current" name="CADIC" offset="0xE8" size="2" mask="0xFFFF"/>
        <register caption="ADC Accumulate Current" name="CADAC3" offset="0xE3" size="1" mask="0xFF" ocd-rw="R"/>
        <register caption="ADC Accumulate Current" name="CADAC2" offset="0xE2" size="1" mask="0xFF" ocd-rw="R"/>
        <register caption="ADC Accumulate Current" name="CADAC1" offset="0xE1" size="1" mask="0xFF" ocd-rw="R"/>
        <register caption="ADC Accumulate Current" name="CADAC0" offset="0xE0" size="1" mask="0xFF" ocd-rw="R"/>
        <register caption="CC-ADC Regular Charge Current" name="CADRCC" offset="0xE6" size="1" mask="0xFF"/>
        <register caption="CC-ADC Regular Discharge Current" name="CADRDC" offset="0xE7" size="1" mask="0xFF"/>
      </register-group>
      <value-group caption="" name="ANALOG_CADA_ACC_TIME">
        <value caption="125ms" name="VAL_0x00" value="0x00"/>
        <value caption="250ms" name="VAL_0x01" value="0x01"/>
        <value caption="500ms" name="VAL_0x02" value="0x02"/>
        <value caption="1000ms" name="VAL_0x03" value="0x03"/>
      </value-group>
    </module>
    <module caption="Cell Balancing" name="CELL_BALANCING">
      <register-group caption="Cell Balancing" name="CELL_BALANCING">
        <register caption="Cell Balancing Control Register" name="CBCR" offset="0xF1" size="1">
          <bitfield caption="Cell Balancing Enables" mask="0x0F" name="CBE" lsb="1"/>
        </register>
      </register-group>
    </module>
    <module caption="CPU Registers" name="CPU">
      <register-group caption="CPU Registers" name="CPU">
        <register caption="Status Register" name="SREG" offset="0x5F" size="1">
          <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
          <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
          <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
          <bitfield caption="Sign Bit" mask="0x10" name="S"/>
          <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
          <bitfield caption="Negative Flag" mask="0x04" name="N"/>
          <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
          <bitfield caption="Carry Flag" mask="0x01" name="C"/>
        </register>
